Repository: mohamed930/RegisteryAppSwiftUI
Catalog: RegisterAppSwitUI/Assests/Localizable.xcstrings
Source language: en
Languages: ar

source: Average of Credit Transaction Last 6 Months
ar: متوسط معاملة الائتمان في الأشهر الستة الماضية

source: Average Sales Transactions
ar: متوسط معاملات المبيعات

source: Commercial Record Information
ar: معلومات السجل التجاري

source: Commercial Record Number
ar: رقم السجل التجاري

source: Commercial Record Scan
ar: مسح السجل التجاري

source: Corporate Establishment Date
ar: تاريخ تأسيس الشركة

source: Corporate Main Activity
ar: النشاط الرئيسي للشركة

source: Corporate Name
ar: اسم الشركة

source: Corporate Short Name
ar: الاسم المختصر للشركة

source: CR Expiry Date
ar: تاريخ انتهاء السجل التجاري

source: ID Scan
ar: مسح الهوية

source: Initiation
ar: بدء

source: Please input average of credit transaction in last 6 months
ar: يرجى إدخال متوسط المعاملة الائتمانية في الأشهر الستة الماضية

source: Please input average sales transactions
ar: يرجى إدخال متوسط معاملات المبيعات

source: Please input corporate main activity
ar: يرجى إدخال النشاط الرئيسي للشركة

source: Please input corporate short name
ar: يرجى إدخال الاسم المختصر للشركة

source: Please input CR expiry date
ar: يرجي إدخال تاريخ انتهاء السجل التجاري

source: Please input total annual revenue
ar: يرجى إدخال إجمالي الإيرادات السنوية

source: Please input total liabilities in other corporates
ar: يرجى إدخال إجمالي الالتزامات في الشركات الأخرى

source: Please input your commercial Record number
ar: يرجى إدخال رقم السجل التجاري الخاص بك

source: Please input your corporate name
ar: يرجى إدخال اسم شركتك

source: Please input your Qatar ID Number
ar: يرجى إدخال رقم الهوية القطرية الخاص بك

source: PROCEED
ar: تابع

source: Qatar ID Number
ar: رقم الهوية القطرية

source: Registration
ar: تسجيل

source: Scan Back side
ar: مسح الجانب الخلفي

source: Scan CR Here
ar: امسح السجل التجاري هنا

source: Scan front side
ar: مسح الجانب الأمامي

# Step %@ of %@
source: Step %1$@ of %2$@
ar: خطوه %1$@ من %2$@

source: Total Annual Revenue
ar: إجمالي الإيرادات السنوية

source: Total Liabilities in Other Corporates
ar: إجمالي الالتزامات في الشركات الأخرى

source: User Information
ar: معلومات المستخدم

source: Welcome!
ar: مرحباَ!

source: You are few clicks away from being a member of First Finance family
ar: أنت على بعد بضع نقرات من أن تكون عضوا في عائلة First Finance
